In [1]:
import numpy as np
import pandas as pd

In [6]:
df=pd.DataFrame({"key1":["a","c","b","b","a","c","b"],
                "key2":["one","one","three","two","three","one","two"],
                "d1":np.random.randint(1,20,7),
                "d2":np.random.randint(20,50,7)})
df

  key1   key2  d1  d2
0    a    one   6  25
1    c    one  12  32
2    b  three  11  28
3    b    two  14  42
4    a  three  10  42
5    c    one  12  41
6    b    two   5  46

In [10]:
grouped=df["d1"].groupby(df["key1"])

In [11]:
grouped.mean()

key1
a     8.0
b    10.0
c    12.0
Name: d1, dtype: float64

In [14]:
means=df["d1"].groupby(df["key1"]).mean()
means

key1
a     8.0
b    10.0
c    12.0
Name: d1, dtype: float64

In [18]:
s1=pd.Series(["ind","ind","pak","shri","pak","ind","pak"])

In [19]:
df["d1"].groupby(s1).mean()

ind     10.000000
pak      8.666667
shri    14.000000
Name: d1, dtype: float64

In [20]:
df.groupby("key1").mean()

        d1         d2
key1
a      8.0  33.500000
b     10.0  38.666667
c     12.0  36.500000

In [48]:
a=pd.DataFrame(df["d1"].groupby(df["key1"]).size())

In [25]:
#missing vaule in the data will be excluded from the result

### iterating over the groups

In [50]:
for val in (df["d1"].groupby(df["key1"]).mean()):
    print(val)
    #print(mean)

8.0
10.0
12.0

In [35]:
for i,j in df.groupby("key1"):
    print(i)
    print(j)

a
  key1   key2  d1  d2
0    a    one   6  25
4    a  three  10  42
b
  key1   key2  d1  d2
2    b  three  11  28
3    b    two  14  42
6    b    two   5  46
c
  key1 key2  d1  d2
1    c  one  12  32
5    c  one  12  41

In [39]:
for (j,k),i in df.groupby(["key1","key2"]):
    print(j,k)
    print(i)

a one
  key1 key2  d1  d2
0    a  one   6  25
a three
  key1   key2  d1  d2
4    a  three  10  42
b three
  key1   key2  d1  d2
2    b  three  11  28
b two
  key1 key2  d1  d2
3    b  two  14  42
6    b  two   5  46
c one
  key1 key2  d1  d2
1    c  one  12  32
5    c  one  12  41

In [59]:
a1=dict(df["d1"].groupby(df["key1"]).size())
a1

{'a': 2, 'b': 3, 'c': 2}

In [69]:
for key,val in a1.items():
    print(val)
    print(key)

2
a
3
b
2
c

In [70]:
df

  key1   key2  d1  d2
0    a    one   6  25
1    c    one  12  32
2    b  three  11  28
3    b    two  14  42
4    a  three  10  42
5    c    one  12  41
6    b    two   5  46

In [76]:
dtype=dict(list(df.groupby(df.dtypes,axis=1)))

In [81]:
for i,j in dtype.items():
    print(i)
    #print(j)

int32
object

In [108]:
# if the data is passed in scalar will return scalar output

In [109]:
print(dict(list(df.groupby("key1")["d1"])))
print("*"*100)
dict(list(df.groupby("key1")[["d1"]]))

{'a': 0     6
4    10
Name: d1, dtype: int32, 'b': 2    11
3    14
6     5
Name: d1, dtype: int32, 'c': 1    12
5    12
Name: d1, dtype: int32}
****************************************************************************************************

{'a':    d1
 0   6
 4  10,
 'b':    d1
 2  11
 3  14
 6   5,
 'c':    d1
 1  12
 5  12}

In [110]:
print(list(df["d1"].groupby(df["key1"])))
print("*"*100)
print(list(df[["d1"]].groupby(df["key1"])))

[('a', 0     6
4    10
Name: d1, dtype: int32), ('b', 2    11
3    14
6     5
Name: d1, dtype: int32), ('c', 1    12
5    12
Name: d1, dtype: int32)]
****************************************************************************************************
[('a',    d1
0   6
4  10), ('b',    d1
2  11
3  14
6   5), ('c',    d1
1  12
5  12)]

In [111]:
df.groupby("key1")[["d2"]].mean()

             d2
key1
a     33.500000
b     38.666667
c     36.500000

In [112]:
df["d2"].groupby(df["key2"]).mean()

key2
one      32.666667
three    35.000000
two      44.000000
Name: d2, dtype: float64

### grouping with dict and series

In [176]:
df1=pd.DataFrame(np.random.randint(1,300,size=(5,5)),
                columns=["a","b","c","d","e"],
                index=["ind","pak","uk","usa","ger"])
df_copy=df1.copy()

In [148]:
df1.loc["usa",["a","c"]]=np.nan

In [149]:
df1

         a    b      c    d    e
ind  297.0  282   56.0  259  250
pak  212.0  225  289.0  180  163
uk   141.0   15  291.0   88  196
usa    NaN    1    NaN  115    9
ger  127.0  136   68.0  261   56

In [ ]:
#using the dict can done grouping

In [135]:
mapping={"a":"red","b":"yellow","c":"red","d":"purple","e":"yellow","f":"orange"}

In [136]:
df_col=df1.groupby(mapping,axis=1)

In [137]:
df_col.sum()

     purple    red  yellow
ind    84.0  375.0   378.0
pak    75.0  342.0   295.0
uk    142.0  289.0   225.0
usa   228.0    0.0   409.0
ger    47.0  340.0   327.0

In [138]:
# using the series same thing can be done

In [140]:
s1=pd.Series(mapping)
s1

a       red
b    yellow
c       red
d    purple
e    yellow
f    orange
dtype: object

In [142]:
df_col2=df1.groupby(s1,axis=1)
df_col2.sum()

     purple    red  yellow
ind    84.0  375.0   378.0
pak    75.0  342.0   295.0
uk    142.0  289.0   225.0
usa   228.0    0.0   409.0
ger    47.0  340.0   327.0

In [143]:
df1.groupby(s1,axis=1).count()

     purple  red  yellow
ind       1    2       2
pak       1    2       2
uk        1    2       2
usa       1    0       2
ger       1    2       2

###  grouping with function

In [144]:
df1.groupby(len).sum()

       a    b      c    d    e
2   55.0    2  234.0  142  223
3  600.0  771  457.0  434  638

In [159]:
# df_copy=pd.DataFrame({"a":[23,34,45,56,67],
#                      "b":[34,45,56,67,78]})
# d1=pd.DataFrame(np.zeros((len(df_copy),len(df_copy))),index=df_copy["a"],columns=df_copy["a"])

In [169]:
ind=pd.MultiIndex.from_arrays([["ind","ind","ind","uk","uk"],[1,2,3,1,2]],
                             names=["country","code"])

In [171]:
heir_df=pd.DataFrame(np.random.randn(5,5),columns=ind)
heir_df

country       ind                            uk
code            1         2         3         1         2
0       -1.689917  0.241640 -0.598299 -1.078659 -0.142356
1        0.632808  1.286821  1.300747 -1.432260  1.200925
2        0.152779 -0.268745  0.857233  1.484231 -0.214666
3        0.863507  1.342628 -0.134688 -0.430362 -0.079820
4       -1.220960 -0.468210  0.299927  1.349293 -0.256490

In [172]:
heir_df.groupby(level="country",axis=1).mean()

country       ind        uk
0       -0.682192 -0.610507
1        1.073459 -0.115667
2        0.247089  0.634783
3        0.690482 -0.255091
4       -0.463081  0.546401

In [174]:
heir_df.groupby(level="code",axis=1).mean()

code         1         2         3
0    -1.384288  0.049642 -0.598299
1    -0.399726  1.243873  1.300747
2     0.818505 -0.241705  0.857233
3     0.216573  0.631404 -0.134688
4     0.064166 -0.362350  0.299927

In [181]:
df.drop(columns=["uk","usa"],inplace=True)

In [183]:
grouped=df.groupby("key1")

In [184]:
grouped["d2"].quantile(0.7)

key1
a    36.9
b    43.6
c    38.3
Name: d2, dtype: float64

In [190]:
df

  key1   key2  d1  d2
0    a    one   6  25
1    c    one  12  32
2    b  three  11  28
3    b    two  14  42
4    a  three  10  42
5    c    one  12  41
6    b    two   5  46

In [188]:
#if we have our own aggrigation then use agg
def my_own_agg(arr):
    rang=arr.max()-arr.min()
    return rang

In [189]:
grouped.agg(my_own_agg)

C:\Users\Pratheek\AppData\Local\Temp\ipykernel_15228\3920136673.py:1: FutureWarning: ['key2'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  grouped.agg(my_own_agg)

      d1  d2
key1
a      4  17
b      9  18
c      0   9

In [193]:
grouped.describe()

        d1                                                  d2             \
     count  mean       std   min   25%   50%   75%   max count       mean
key1
a      2.0   8.0  2.828427   6.0   7.0   8.0   9.0  10.0   2.0  33.500000
b      3.0  10.0  4.582576   5.0   8.0  11.0  12.5  14.0   3.0  38.666667
c      2.0  12.0  0.000000  12.0  12.0  12.0  12.0  12.0   2.0  36.500000


            std   min    25%   50%    75%   max
key1
a     12.020815  25.0  29.25  33.5  37.75  42.0
b      9.451631  28.0  35.00  42.0  44.00  46.0
c      6.363961  32.0  34.25  36.5  38.75  41.0

In [200]:
df1=pd.read_csv("C:/nidhisha/dataset/tips.csv")
df1.head(3)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3